In [7]:
import pandas as pd

In [5]:
#pd.Series(data, index=1)
data = [1, 2, 3, 4, 5]
s1 = pd.Series(data)
print(s1)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [6]:
data = [1, 2, 3, 4, 5]
index = ['a', 'b', 'c', 'd', 'e']
s2 = pd.Series(data, index=index)
print(s2)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [27]:
ser[0],ser['a']

C:\Users\Admin\AppData\Local\Temp\ipykernel_15976\143202658.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  ser[0],ser['a']

(np.int64(1), np.int64(1))

In [18]:
index_s = ['a', 'b', 'c', 'd', 'e']
ser=pd.Series([1,2,3,4,5], index=index_s)
ser

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [14]:
# 딕셔너리로 시리즈 생성 - 키가 인덱스가 됨
dict_data = {'a':1, 'b':2, 'c':3, 'd':4}
s3 = pd.Series(dict_data)
print(s3)

a    1
b    2
c    3
d    4
dtype: int64

In [22]:
ser2 = pd.Series([10,"banana"])
type(ser2)
ser2

0        10
1    banana
dtype: object

In [8]:
population = pd.Series([9776, 2729, 1566, 3158], 
                    index=['서울', '부산', '인천', '대구'])
print(population['서울'])  # 9776 출력
print(population[['서울', '부산']])  # 서울과 부산의 데이터만 선택 # 펜시 인덱싱, 0,1 

population.info()

9776
서울    9776
부산    2729
dtype: int64
<class 'pandas.core.series.Series'>
Index: 4 entries, 서울 to 대구
Series name: None
Non-Null Count  Dtype
--------------  -----
4 non-null      int64
dtypes: int64(1)
memory usage: 236.0+ bytes

In [31]:
ser.loc()
ser.iloc[0]
ser.iloc[0]
ser.loc['a']

np.int64(1)

In [32]:
# 데이터 프레임의 생성

In [ ]:
ser.loc()
ser.iloc[0]
ser.iloc[0]
ser.loc['a']

np.int64(1)

In [9]:
scientists = pd.DataFrame({
        "Name": ["Rosaline Franklin", "William Gosset"],
        "Occupation": ["Chemist", "Statistician"],
        "Born": ["1920-07-25", "1876-06-13"],
        "Died": ["1958-04-16", "1937-10-16"],
        "Age": [37, 61],
})

In [61]:
print("\n")
scientists.columns

print("\n")
scientists.iloc[0]

scientists['Name']

Rosaline Franklin    Rosaline Franklin
William Gosset          William Gosset
Name: Name, dtype: object

In [11]:
scientists['Name']

#iloc 인덱스 로케이터
#loc    인덱스 로케이터

0    Rosaline Franklin
1       William Gosset
Name: Name, dtype: object

In [15]:
scientists.index = ['Rosaline Franklin', 'William Gosset']

In [16]:
scientists.loc['William Gosset']

Name          William Gosset
Occupation      Statistician
Born              1876-06-13
Died              1937-10-16
Age                       61
Name: William Gosset, dtype: object

In [17]:
scientists.loc['William Gosset','Born']

'1876-06-13'

In [97]:
scientists.index

Index(['Rosaline Franklin', 'William Gosset'], dtype='object')

In [18]:
scientists.iloc[0]

Name          Rosaline Franklin
Occupation              Chemist
Born                 1920-07-25
Died                 1958-04-16
Age                          37
Name: Rosaline Franklin, dtype: object

In [19]:
scientists.iloc[:, 0:2]

                                Name    Occupation
Rosaline Franklin  Rosaline Franklin       Chemist
William Gosset        William Gosset  Statistician

In [99]:
scientists

,Name,Occupation,Born,Died,Age
Rosaline Franklin,Rosaline Franklin,Chemist,1920-07-25,1958-04-16,37
William Gosset,William Gosset,Statistician,1876-06-13,1937-10-16,61

In [100]:
# 리스트로 데이터프레임 생성
data = [[1, 2, 3],
        [4, 5, 6],
        [7, 8, 9]]

df = pd.DataFrame(data)
print(df)


# 열 이름 지정하여 생성
df = pd.DataFrame(data, columns=['A', 'B', 'C'])
print(df)

df.iloc[0]

df.loc[2]

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9
   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

A    7
B    8
C    9
Name: 2, dtype: int64

In [20]:
sci1 = pd.DataFrame({
        "Name": ["Rosaline Franklin", "William Gosset"],
        "Occupation": ["Chemist", "Statistician"],
        "Born": ["1920-07-25", "1876-06-13"],
        "Died": ["1958-04-16", "1937-10-16"],
        "Age": [37, 61],
})

In [22]:
sci1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        2 non-null      object
 1   Occupation  2 non-null      object
 2   Born        2 non-null      object
 3   Died        2 non-null      object
 4   Age         2 non-null      int64
dtypes: int64(1), object(4)
memory usage: 212.0+ bytes

In [23]:
sci1 #rangeindex

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [25]:
print(sci1.loc[0,'Name'])
print(sci1.loc[1,'Name'])
sci1.loc[0,'Occupation']

sci1.to_csv('./data/scientists_1.csv')

Rosaline Franklin
William Gosset

In [ ]:
sci1.loc[0,'Name'] #[row, col] 인덱싱
'Rosaline Franklin'
#iloc로 william gosset의 age 추출
#born, died 만 추출
#occupation만 추출

In [28]:
sci1.loc[0,'Name']

'Rosaline Franklin'

In [34]:
sci1

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [48]:
print(sci1.iloc[1,4])
print('\n')
print(sci1.iloc[:,2:4])
print(sci1.iloc[:,1])

61


         Born        Died
0  1920-07-25  1958-04-16
1  1876-06-13  1937-10-16
0         Chemist
1    Statistician
Name: Occupation, dtype: object

In [130]:
sci1.to_csv('./data/scientists_2.csv', index=False)

In [138]:
sci1.to_pickle('./data/scientist.pickle')

In [140]:
df2=pd.read_pickle('./data/scientist.pickle')
df2

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [133]:
df = pd.read_csv('./data/scientists_1.csv')
df

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [152]:
df3 = pd.read_csv('./data/scientists.csv')
df3

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [ ]:
#데이터 미리보기 
#1.info, / tail

In [161]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        2 non-null      object
 1   Occupation  2 non-null      object
 2   Born        2 non-null      object
 3   Died        2 non-null      object
 4   Age         2 non-null      int64
dtypes: int64(1), object(4)
memory usage: 212.0+ bytes

In [162]:
df3.head(3) # default=5

                   Name        Born        Died  Age    Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37       Chemist
1        William Gosset  1876-06-13  1937-10-16   61  Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90         Nurse

In [163]:
df3.tail(3)

           Name        Born        Died  Age          Occupation
5     John Snow  1813-03-15  1858-06-16   45           Physician
6   Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7  Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [ ]:
df3.describe()
#df3.info()

             Age
count   8.000000
mean   59.125000
std    18.325918
min    37.000000
25%    44.000000
50%    58.500000
75%    68.750000
max    90.000000

In [186]:
df3['Age']
df3.loc[:,'Age'].describe()
static=df3.loc[:,'Age'].describe()
static

count     8.000000
mean     59.125000
std      18.325918
min      37.000000
25%      44.000000
50%      58.500000
75%      68.750000
max      90.000000
Name: Age, dtype: float64

In [92]:
import pandas as pd

# 샘플 데이터프레임 생성
data = {
    '이름': ['김철수', '이영희', '박민수', '정수진', '최영호', '한미래', '윤지원'],
    '나이': [25, 28, 22, 31, 27, 24, 29],
    '점수': [85, 92, 78, 95, 88, 73, 91]
}
df = pd.DataFrame(data)

# 처음 5개 행 보기
print("=== head() ===")
print(df.head())

# 마지막 3개 행 보기
print("\n=== tail(3) ===")
print(df.tail(3))

=== head() ===
    이름  나이  점수
0  김철수  25  85
1  이영희  28  92
2  박민수  22  78
3  정수진  31  95
4  최영호  27  88

=== tail(3) ===
    이름  나이  점수
4  최영호  27  88
5  한미래  24  73
6  윤지원  29  91

In [51]:

# 데이터프레임 기본 정보
print("\n=== info() ===")
print(df.info())

# 기술 통계량
print("\n=== describe() ===")
print(df.describe())

=== info() ===
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      7 non-null      object
 1   나이      7 non-null      int64
 2   점수      7 non-null      int64
dtypes: int64(2), object(1)
memory usage: 300.0+ bytes
None

=== describe() ===
              나이         점수
count   7.000000   7.000000
mean   26.571429  86.000000
std     3.101459   7.958224
min    22.000000  73.000000
25%    24.500000  81.500000
50%    27.000000  88.000000
75%    28.500000  91.500000
max    31.000000  95.000000

In [197]:
print(df.index)    # 행 이름 출력
print(df.columns)  # 열 이름 출력

RangeIndex(start=0, stop=7, step=1)
Index(['이름', '나이', '점수'], dtype='object')

In [198]:
df.index

RangeIndex(start=0, stop=7, step=1)

In [199]:
df.shape

(7, 3)

In [200]:
df.values

array([['김철수', 25, 85],
       ['이영희', 28, 92],
       ['박민수', 22, 78],
       ['정수진', 31, 95],
       ['최영호', 27, 88],
       ['한미래', 24, 73],
       ['윤지원', 29, 91]], dtype=object)

In [52]:
df.columns = ['name','age', 'score'] #  컬럼 목록을 직접 변경가능
df

  name  age  score
0  김철수   25     85
1  이영희   28     92
2  박민수   22     78
3  정수진   31     95
4  최영호   27     88
5  한미래   24     73
6  윤지원   29     91

In [90]:
df.index = ['a', 'b', 'c', 'd', 'e', 'f', 'g']
df

    이름  나이  점수
a  김철수  25  85
b  이영희  28  92
c  박민수  22  78
d  정수진  31  95
e  최영호  27  88
f  한미래  24  73
g  윤지원  29  91

In [89]:
#일부열의 이름변경 inplace=True <-원본을 바꿔서 리턴안됌
df1= df.rename(columns={'name':'Name', 'age' :'Age'})
df2=df1.rename(index={'a':'A'})
print(df2)

    이름  나이  점수
0  김철수  25  85
1  이영희  28  92
2  박민수  22  78
3  정수진  31  95
4  최영호  27  88
5  한미래  24  73
6  윤지원  29  91

In [88]:
df.iloc[0]

이름    김철수
나이     25
점수     85
Name: 0, dtype: object

In [87]:
df.iloc[0:2]

    이름  나이  점수
0  김철수  25  85
1  이영희  28  92

In [93]:
df.loc[0]

이름    김철수
나이     25
점수     85
Name: 0, dtype: object

In [96]:
df[df['나이']>25]  #조건을 사용한 행 추출

Empty DataFrame
Columns: [이름, 나이, 점수]
Index: []

In [97]:
df[df['점수']>90]  #조건을 사용한 행 추출

    이름  나이  점수
1  이영희  28  92
3  정수진  31  95
6  윤지원  29  91

In [100]:
df.loc[7]=['홍길동',30,79]
df.loc[7]

이름    홍길동
나이     30
점수     79
Name: 7, dtype: object

In [107]:
df.iloc[7]

이름    김길동
나이     30
점수     79
Name: 7, dtype: object

In [185]:
#df.append([8,'박나래',20,50])
#열추가
df['grade'] = ['A','B','C','D','E','F','G']
df
df.rename(columns={'grade':'등급'}, inplace=True)
df

    이름  s_id  나이  점수 등급 등급 등급
0  김철수  S001  25  85  A  A  A
1  이영희  S002  28  92  B  B  B
2  박민수  S003  22  78  C  C  C
3  정수진  S004  31  95  D  D  D
4  최영호  S005  27  88  E  E  E
5  한미래  S006  24  73  F  F  F
6  윤지원  S007  29  91  G  G  G

In [ ]:
df.insert(loc=1, column='s_id', value=['S001', 'S002', 'S003', 'S004', 'S005', 'S006', 'S007','S008'])

ValueError: cannot insert s_id, already exists

In [124]:
df

    이름  s_id  나이  점수 등급 등급 등급
0  김철수  S001  25  85  A  A  A
1  이영희  S002  28  92  B  B  B
2  박민수  S003  22  78  C  C  C
3  정수진  S004  31  95  D  D  D
4  최영호  S005  27  88  E  E  E
5  한미래  S006  24  73  F  F  F
6  윤지원  S007  29  91  G  G  G
7  김길동  S008  30  79  H  H  H

In [ ]:
#df1=df.drop(7, axis=0)
#df=df1
df.drop(7, axis=0, inplace=True)

In [186]:
df

    이름  s_id  나이  점수 등급 등급 등급
0  김철수  S001  25  85  A  A  A
1  이영희  S002  28  92  B  B  B
2  박민수  S003  22  78  C  C  C
3  정수진  S004  31  95  D  D  D
4  최영호  S005  27  88  E  E  E
5  한미래  S006  24  73  F  F  F
6  윤지원  S007  29  91  G  G  G

In [133]:
df.drop('등급', axis=1, inplace=True)

In [137]:
df

    이름  s_id  나이  점수 등급
0  김철수  S001  25  85  A
1  이영희  S002  28  92  B
2  박민수  S003  22  78  C
3  정수진  S004  31  95  D
4  최영호  S005  27  88  E
5  한미래  S006  24  73  F
6  윤지원  S007  29  91  G

In [150]:
df.iloc[:,2:7]

   나이  점수 등급 등급 등급
0  25  85  A  A  A
1  28  92  B  B  B
2  22  78  C  C  C
3  31  95  D  D  D
4  27  88  E  E  E
5  24  73  F  F  F
6  29  91  G  G  G

In [190]:
#df.drop(columns=df.columns[6])

#col_keep = [i for i in range(len(df.columns)) if i!=4]
#df = df.iloc[: , col_keep]

df = df.loc[:, ~df.columns.duplicated()]  # Ttue만 해서 넣는다



df

    이름  s_id  나이    점수 등급
0  김철수  S001  25  85.0  A
1  이영희  S002  28  92.0  B
2  박민수  S003  22  78.0  C
3  정수진  S004  31  95.0  D
4  최영호  S005  27  88.0  E
5  한미래  S006  24  73.0  F
6  윤지원  S007  29  91.0  G

In [ ]:

df = df.astype({'나이': int, '점수': float})

In [189]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      7 non-null      object
 1   s_id    7 non-null      object
 2   나이      7 non-null      int64
 3   점수      7 non-null      float64
 4   등급      7 non-null      object
dtypes: float64(1), int64(1), object(3)
memory usage: 636.0+ bytes

In [191]:
df_new=df.set_index('s_id')
df_new

       이름  나이    점수 등급
s_id
S001  김철수  25  85.0  A
S002  이영희  28  92.0  B
S003  박민수  22  78.0  C
S004  정수진  31  95.0  D
S005  최영호  27  88.0  E
S006  한미래  24  73.0  F
S007  윤지원  29  91.0  G

In [193]:
df_new.reset_index(inplace=True)
df_new

   index  s_id   이름  나이    점수 등급
0      0  S001  김철수  25  85.0  A
1      1  S002  이영희  28  92.0  B
2      2  S003  박민수  22  78.0  C
3      3  S004  정수진  31  95.0  D
4      4  S005  최영호  27  88.0  E
5      5  S006  한미래  24  73.0  F
6      6  S007  윤지원  29  91.0  G

In [202]:
dr=pd.date_range('2025-06-01', periods=7, freq='D')
dr
df_new['date'] =  dr
df_new

   index  s_id   이름  나이    점수 등급       date
0      0  S001  김철수  25  85.0  A 2025-06-01
1      1  S002  이영희  28  92.0  B 2025-06-02
2      2  S003  박민수  22  78.0  C 2025-06-03
3      3  S004  정수진  31  95.0  D 2025-06-04
4      4  S005  최영호  27  88.0  E 2025-06-05
5      5  S006  한미래  24  73.0  F 2025-06-06
6      6  S007  윤지원  29  91.0  G 2025-06-07

In [205]:
df_new1 = df_new.set_index('date') # 인덱스라 그렇다 -> 맨앞이 됐음
df_new1

            index  s_id   이름  나이    점수 등급
date
2025-06-01      0  S001  김철수  25  85.0  A
2025-06-02      1  S002  이영희  28  92.0  B
2025-06-03      2  S003  박민수  22  78.0  C
2025-06-04      3  S004  정수진  31  95.0  D
2025-06-05      4  S005  최영호  27  88.0  E
2025-06-06      5  S006  한미래  24  73.0  F
2025-06-07      6  S007  윤지원  29  91.0  G

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   index   7 non-null      int64
 1   s_id    7 non-null      object
 2   이름      7 non-null      object
 3   나이      7 non-null      int64
 4   점수      7 non-null      float64
 5   등급      7 non-null      object
 6   date    7 non-null      datetime64[ns]
dtypes: datetime64[ns](1), float64(1), int64(2), object(3)
memory usage: 524.0+ bytes